speeduino/speeduino/speeduino/board_avr2560.h
#pragma once

/** DO NOT INCLUDE DIRECTLY - should be included via board_definition.h */

#define CORE_AVR

#include <stdint.h>
#include <avr/interrupt.h>
#include <avr/io.h>

/*
***********************************************************************************************************
* General
*/
#define BOARD_MAX_DIGITAL_PINS 54 //digital pins +1
#define BOARD_MAX_IO_PINS 70 //digital pins + analog channels + 1
#ifndef LED_BUILTIN
  #define LED_BUILTIN 13
#endif

#ifndef INJ_CHANNELS
  #define INJ_CHANNELS 4
#endif
#ifndef IGN_CHANNELS
  #define IGN_CHANNELS 5
#endif

/** @brief The timer overflow type
 * 
 * On some boards timers can overflow at less than the timer register width
 */
using COMPARE_TYPE = uint16_t;

namespace {
  /** @brief The timer tick length in µS */
  constexpr uint32_t TICK_RESOLUTION = 4U;
}

/** @brief Convert µS to timer ticks */
static constexpr COMPARE_TYPE uS_TO_TIMER_COMPARE(uint32_t micros)
{
  // Faster than micros/TICK_RESOLUTION
  constexpr uint32_t SHIFT = TICK_RESOLUTION/2U;
  return (COMPARE_TYPE)(micros >> SHIFT); 
}

/** @brief Convert timer ticks to µS */
static constexpr uint32_t ticksToMicros(COMPARE_TYPE ticks)
{
  return ticks * TICK_RESOLUTION;
}

#define TS_SERIAL_BUFFER_SIZE (256+7+1) //Size of the serial buffer used by new comms protocol. The largest single packet is the O2 calibration which is 256 bytes + 7 bytes of overhead
#define FPU_MAX_SIZE 0 //Size of the FPU buffer. 0 means no FPU.
#ifdef PLATFORMIO
  #define RTC_LIB_H <TimeLib.h>
#else
  #define RTC_LIB_H <Time.h>
#endif
constexpr uint16_t BLOCKING_FACTOR = 121;
constexpr uint16_t TABLE_BLOCKING_FACTOR = 64;
constexpr uint16_t SCATTER_ARRAY_SIZE = 32;
static inline bool pinIsReserved(uint8_t pin) { return pin==0U; } //Forbidden pins like USB on other boards

/*
***********************************************************************************************************
* Schedules
*/
  //Refer to svn.savannah.nongnu.org/viewvc/trunk/avr-libc/include/avr/iomxx0_1.h?root=avr-libc&view=markup
#define FUEL1_COUNTER TCNT3
#define FUEL2_COUNTER TCNT3
#define FUEL3_COUNTER TCNT3
#define FUEL4_COUNTER TCNT4
#define FUEL5_COUNTER TCNT4
#define FUEL6_COUNTER TCNT4 //Replaces ignition 4
#define FUEL7_COUNTER TCNT5 //Replaces ignition 3
#define FUEL8_COUNTER TCNT5 //Replaces ignition 2

#define IGN1_COUNTER  TCNT5
#define IGN2_COUNTER  TCNT5
#define IGN3_COUNTER  TCNT5
#define IGN4_COUNTER  TCNT4
#define IGN5_COUNTER  TCNT4
#define IGN6_COUNTER  TCNT4 //Replaces injector 4
#define IGN7_COUNTER  TCNT3 //Replaces injector 3
#define IGN8_COUNTER  TCNT3 //Replaces injector 2

#define FUEL1_COMPARE OCR3A
#define FUEL2_COMPARE OCR3B
#define FUEL3_COMPARE OCR3C
#define FUEL4_COMPARE OCR4B //Replaces ignition 6
#define FUEL5_COMPARE OCR4C //Replaces ignition 5
#define FUEL6_COMPARE OCR4A //Replaces ignition 4
#define FUEL7_COMPARE OCR5C //Replaces ignition 3
#define FUEL8_COMPARE OCR5B //Replaces ignition 2

#define IGN1_COMPARE  OCR5A
#define IGN2_COMPARE  OCR5B
#define IGN3_COMPARE  OCR5C
#define IGN4_COMPARE  OCR4A //Replaces injector 6
#define IGN5_COMPARE  OCR4C //Replaces injector 5
#define IGN6_COMPARE  OCR4B //Replaces injector 4
#define IGN7_COMPARE  OCR3C //Replaces injector 3
#define IGN8_COMPARE  OCR3B //Replaces injector 2

//Note that the interrupt flag is reset BEFORE the interrupt is enabled
static inline void FUEL1_TIMER_ENABLE(void) { TIFR3 |= (1<<OCF3A) ; TIMSK3 |= (1 << OCIE3A); } //Turn on the A compare unit (ie turn on the interrupt)
static inline void FUEL2_TIMER_ENABLE(void) { TIFR3 |= (1<<OCF3B); TIMSK3 |= (1 << OCIE3B); } //Turn on the B compare unit (ie turn on the interrupt)
static inline void FUEL3_TIMER_ENABLE(void) { TIFR3 |= (1<<OCF3C); TIMSK3 |= (1 << OCIE3C); } //Turn on the C compare unit (ie turn on the interrupt)
static inline void FUEL4_TIMER_ENABLE(void) { TIFR4 |= (1<<OCF4B); TIMSK4 |= (1 << OCIE4B); } //Turn on the B compare unit (ie turn on the interrupt)
static inline void FUEL5_TIMER_ENABLE(void) { TIFR4 |= (1<<OCF4C); TIMSK4 |= (1 << OCIE4C); } //Turn on the C compare unit (ie turn on the interrupt)
static inline void FUEL6_TIMER_ENABLE(void) { TIFR4 |= (1<<OCF4A); TIMSK4 |= (1 << OCIE4A); } //Turn on the A compare unit (ie turn on the interrupt)
static inline void FUEL7_TIMER_ENABLE(void) { TIFR5 |= (1<<OCF5C); TIMSK5 |= (1 << OCIE5C); } //
static inline void FUEL8_TIMER_ENABLE(void) { TIFR5 |= (1<<OCF5B); TIMSK5 |= (1 << OCIE5B); } //

static inline void FUEL1_TIMER_DISABLE(void) { TIMSK3 &= ~(1 << OCIE3A); } // //Turn off this output compare unit
static inline void FUEL2_TIMER_DISABLE(void) { TIMSK3 &= ~(1 << OCIE3B); } // //Turn off this output compare unit
static inline void FUEL3_TIMER_DISABLE(void) { TIMSK3 &= ~(1 << OCIE3C); } // //Turn off this output compare unit
static inline void FUEL4_TIMER_DISABLE(void) { TIMSK4 &= ~(1 << OCIE4B); } ////Turn off this output compare unit
static inline void FUEL5_TIMER_DISABLE(void) { TIMSK4 &= ~(1 << OCIE4C); } // //
static inline void FUEL6_TIMER_DISABLE(void) { TIMSK4 &= ~(1 << OCIE4A); } // //
static inline void FUEL7_TIMER_DISABLE(void) { TIMSK5 &= ~(1 << OCIE5C); } // //
static inline void FUEL8_TIMER_DISABLE(void) { TIMSK5 &= ~(1 << OCIE5B); } //

  //These have the TIFR5 bits set to 1 to clear the interrupt flag. This prevents a false interrupt being called the first time the channel is enabled.
static inline void IGN1_TIMER_ENABLE(void) { TIFR5 |= (1<<OCF5A); TIMSK5 |= (1 << OCIE5A); } //Turn on the A compare unit (ie turn on the interrupt)
static inline void IGN2_TIMER_ENABLE(void) { TIFR5 |= (1<<OCF5B); TIMSK5 |= (1 << OCIE5B); }//Turn on the B compare unit (ie turn on the interrupt)
static inline void IGN3_TIMER_ENABLE(void) { TIFR5 |= (1<<OCF5C); TIMSK5 |= (1 << OCIE5C); }//Turn on the C compare unit (ie turn on the interrupt)
static inline void IGN4_TIMER_ENABLE(void) { TIFR4 |= (1<<OCF4A); TIMSK4 |= (1 << OCIE4A); }//Turn on the A compare unit (ie turn on the interrupt)
static inline void IGN5_TIMER_ENABLE(void) { TIFR4 |= (1<<OCF4C); TIMSK4 |= (1 << OCIE4C); } //Turn on the A compare unit (ie turn on the interrupt)
static inline void IGN6_TIMER_ENABLE(void) { TIFR4 |= (1<<OCF4B); TIMSK4 |= (1 << OCIE4B); } //Replaces injector 4
static inline void IGN7_TIMER_ENABLE(void) { TIMSK3 |= (1 << OCIE3C); }//Replaces injector 3
static inline void IGN8_TIMER_ENABLE(void) { TIMSK3 |= (1 << OCIE3B); } //Replaces injector 2

static inline void IGN1_TIMER_DISABLE(void) { TIMSK5 &= ~(1 << OCIE5A); } //Turn off this output compare unit
static inline void IGN2_TIMER_DISABLE(void) { TIMSK5 &= ~(1 << OCIE5B); } //Turn off this output compare unit
static inline void IGN3_TIMER_DISABLE(void) { TIMSK5 &= ~(1 << OCIE5C); } //Turn off this output compare unit
static inline void IGN4_TIMER_DISABLE(void) { TIMSK4 &= ~(1 << OCIE4A); } //Turn off this output compare unit
static inline void IGN5_TIMER_DISABLE(void) { TIMSK4 &= ~(1 << OCIE4C); } //Turn off this output compare unit
static inline void IGN6_TIMER_DISABLE(void) { TIMSK4 &= ~(1 << OCIE4B); } //Replaces injector 4
static inline void IGN7_TIMER_DISABLE(void) { TIMSK3 &= ~(1 << OCIE3C); } //Replaces injector 3
static inline void IGN8_TIMER_DISABLE(void) { TIMSK3 &= ~(1 << OCIE3B); } //Replaces injector 2

/*
***********************************************************************************************************
* Auxiliaries
*/
#define ENABLE_BOOST_TIMER()  TIMSK1 |= (1 << OCIE1A)
#define DISABLE_BOOST_TIMER() TIMSK1 &= ~(1 << OCIE1A)
#define ENABLE_VVT_TIMER()    TIMSK1 |= (1 << OCIE1B)
#define DISABLE_VVT_TIMER()   TIMSK1 &= ~(1 << OCIE1B)

#define BOOST_TIMER_COMPARE   OCR1A
#define BOOST_TIMER_COUNTER   TCNT1
#define VVT_TIMER_COMPARE     OCR1B
#define VVT_TIMER_COUNTER     TCNT1

/*
***********************************************************************************************************
* Idle
*/
#define IDLE_COUNTER TCNT1
#define IDLE_COMPARE OCR1C

#define IDLE_TIMER_ENABLE() TIMSK1 |= (1 << OCIE1C)
#define IDLE_TIMER_DISABLE() TIMSK1 &= ~(1 << OCIE1C)

/*
***********************************************************************************************************
* CAN / Second serial
*/
#define SECONDARY_SERIAL_T HardwareSerial

class fastInputPin_t;
using boardInputPin_t = fastInputPin_t;
class fastOutputPin_t;
using boardOutputPin_t = fastOutputPin_t;

/** @brief Analog pin mapping */
constexpr uint8_t ANALOG_PINS[] = { _ANALOG_PINS_A0_A14 };

/** @brief When the serial buffer is filled to greater than this threshold
 * value, the serial processing operations will be performed more urgently 
 * in order to avoid it overflowing. Serial buffer is 64 bytes long, so the threshold is set at half this as a reasonable figure 
 */
constexpr uint8_t SERIAL_BUFFER_THRESHOLD = 32U;